#Задача 1
a = int(input("Введите сумму вклада "))
b = int(input("Введите годовой процент "))
print (b/100*a+a)

#Задача 2
a = int(input("Введите температуру в градусах Цельсия "))
print ("Температура в градусах Фаренгейта ", a*9/5+32)

#Задача 3
d = int(input("Введите количество дней "))
p = int(input("Введите процент скидки "))
s = int(input("Введите сумму "))
ds = d*3+s
print (ds-(p/100*s))

#Задача 4
a, bc, abc = 2, 37, 237
print (bc*10+a)